{
  "backend/main.mo": "Motoko backend with contact form submissions, public contact info, and user profile management guarded by access control.",
  "feature_evidence.json": "Feature evidence report mapping product features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend React file in the project.",
  "frontend/index.css": "Global Tailwind/OKLCH theme variables and base styles defining light/dark mode colors and design tokens.",
  "frontend/index.html": "Root HTML file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring together all sections and handling smooth scrolling navigation via refs.",
  "frontend/src/components/Footer.tsx": "Footer with quick links, contact info, and caffeine.ai attribution including dynamic year and hostname-based UTM.",
  "frontend/src/components/GradientButton.tsx": "Reusable gradient-styled button wrapper extending the base Button component.",
  "frontend/src/components/sections/AboutSection.tsx": "Displays an about section with a company intro, image, and three feature cards, including a Learn More button callback.",
  "frontend/src/components/sections/ClientResultsSection.tsx": "Shows client result graphics and a CTA card, using a list of images mapped into cards and a callback button.",
  "frontend/src/components/sections/ContactSection.tsx": "Provides a contact form with state handling, form submission via a custom hook, and contact info cards.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders a full-screen hero section with headline, description, and a Get Started button callback.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Displays a grid of project cards with images and metrics, plus a button to view the full portfolio.",
  "frontend/src/components/sections/ServicesSection.tsx": "Renders three service cards with icons and descriptions, along with a button to explore services.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Maps and displays client testimonial cards with quotes, authors, and company info.",
  "frontend/src/components/TopNav.tsx": "Fixed top navigation bar with scroll-aware styling and buttons that trigger smooth section navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hook for managing Internet Identity authentication, including loading, login, logout, and status tracking using AuthClient.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Custom hook that submits a contact form through an actor, tracking submission state, success, and errors.",
  "frontend/src/index.css": "Tailwind base setup defining OKLCH theme variables, dark mode variants, brand colors, and custom gradient utilities.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with OKLCH color variables, brand colors, custom animations, and plugins.",
  "project_state.json": "JSON metadata describing project goals, visual requirements, features, and image assets needed for the SolviroStudio portfolio site."
}