{
  "backend/main.mo": "Motoko actor handling public contact form submissions, admin‑restricted submission viewing, and user profile read/write with access control.",
  "feature_evidence.json": "Empty feature evidence report stub with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend files used as reference metadata.",
  "frontend/index.css": "Global Tailwind base/theme definitions using OKLCH variables for light and dark modes.",
  "frontend/index.html": "HTML entry file mounting the SPA root and loading main.tsx with favicon metadata.",
  "frontend/src/App.tsx": "Main React app wiring scroll navigation and rendering all layout sections with refs.",
  "frontend/src/components/BrandLogo.tsx": "Renders SolviroStudio logo image with crisp scaling and configurable height.",
  "frontend/src/components/Footer.tsx": "Footer showing logo, quick links, contact info, and caffeine.ai attribution.",
  "frontend/src/components/GradientButton.tsx": "Styled gradient CTA button wrapper extending the base Button component.",
  "frontend/src/components/sections/AboutSection.tsx": "About section with intro text, team image, value cards, and Learn More CTA.",
  "frontend/src/components/sections/ClientResultsSection.tsx": "Displays a results showcase with image cards and a CTA button using provided callback.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact form with email, phone info, validation states, and submission via a custom hook.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders the main hero banner with headline, subtext, and a start button callback.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Shows a grid of portfolio campaign cards with metrics and a button to view the full portfolio.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists service offerings with icons and a CTA button to explore more.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Displays client testimonials in a grid of styled cards.",
  "frontend/src/components/TopNav.tsx": "Fixed top navigation bar with scroll detection and smooth section navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and status handling via AuthClient.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Custom hook that submits a contact form through an actor, tracking submitting, success, and error states.",
  "frontend/src/index.css": "Defines global Tailwind base styles, theme variables, dark mode settings, and utility classes including brand gradients and logo styling.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project configuration, requirements, and state for building a long-scroll SolviroStudio portfolio site with brand guidelines and section specifications."
}