{
  "backend/main.mo": "Motoko backend handling contact form submissions, user profiles, and admin‑gated queries with AccessControl authorization.",
  "feature_evidence.json": "Feature evidence report listing implemented branding and favicon updates along with affected files and components.",
  "frontend-file-summaries.txt": "Text file containing predefined summaries for major frontend components and configuration files.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions establishing light/dark theme colors and base styling.",
  "frontend/index.html": "HTML entry point setting metadata and linking the generated favicon and main script.",
  "frontend/src/App.tsx": "Main React component wiring all page sections and smooth-scroll navigation via refs.",
  "frontend/src/components/BrandLogo.tsx": "Reusable logo image component rendering the SolviroStudio header asset with adjustable sizing.",
  "frontend/src/components/Footer.tsx": "Footer component with logo, navigation links, contact info, and caffeine.ai attribution.",
  "frontend/src/components/GradientButton.tsx": "Wrapper around Button applying the brand gradient styling to CTAs.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an About section with a description of SolviroStudio, an image, and three feature cards. Includes a Learn More button callback.",
  "frontend/src/components/sections/ClientResultsSection.tsx": "Displays client results with performance graphic cards and a CTA button. Uses a grid of result images and a final call‑to‑action card.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact form with email, phone info, and validation states using a custom submit hook. Includes form handling and informational cards.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows a full‑screen hero with headline, subtext, and a Get Started button. Styled with gradient background and overlay.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Renders a portfolio grid of solar marketing projects with images and performance metrics. Includes a button to view the full portfolio.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists three service offerings with icons and descriptions, followed by a button to explore services. Uses Card components for layout.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Displays a grid of client testimonials with quotes, authors, roles, and companies. Each testimonial is styled within a Card component.",
  "frontend/src/components/TopNav.tsx": "Fixed top navigation bar showing the logo, scroll‑aware styling, and section navigation buttons.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, handling authentication, secret initialization, and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and tracking login status.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Defines a hook to submit a contact form through an actor, with state for submission status and error handling.",
  "frontend/src/index.css": "Tailwind base/config styles plus custom CSS variables, dark mode themes, and brand gradient utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins with brand-specific design tokens.",
  "project_state.json": "Stores project metadata, requirements, architecture notes, and expected assets for the SolviroStudio website build."
}