{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace SolviroStudio site-wide branding with uploaded logo (header, footer, favicon)",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Add uploaded logo to static assets and include optimized header and favicon variants with crisp transparency for light/dark backgrounds.",
      "acceptanceCriteria": [
        "The repository contains the original uploaded logo file stored under frontend/public/assets/generated (or a clearly documented assets folder under frontend/public) without routing through the backend.",
        "At least two optimized variants exist in frontend/public/assets/generated: one for header/nav display and one square icon suitable for favicon/app icon usage.",
        "The optimized logo variants have transparent background (where applicable) and look sharp when rendered at typical navbar sizes (e.g., ~28–40px tall) and at favicon sizes."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/ChatGPT Image Feb 10, 2026, 06_11_32 AM.png",
          "operation": "create",
          "description": "Add the original user-uploaded logo file to static assets for archival/reference (served directly by the frontend; no backend routing)."
        },
        {
          "path": "frontend/public/assets/generated/solvirostudio-logo-header.dim_800x240.png",
          "operation": "create",
          "description": "Add transparent-background, optimized header/nav logo variant derived from the uploaded logo; tuned to render sharply around ~28–40px tall on both light and dark nav backgrounds."
        },
        {
          "path": "frontend/public/assets/generated/solvirostudio-favicon.dim_256x256.png",
          "operation": "create",
          "description": "Add square, optimized icon variant derived from the uploaded logo for favicon/app icon usage (transparent background where applicable)."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Replace header and footer SolviroStudio text branding with the new logo image while preserving accessibility and layout stability.",
      "acceptanceCriteria": [
        "Top navigation (frontend/src/components/TopNav.tsx) displays the new logo image instead of the text “SolviroStudio”.",
        "Footer (frontend/src/components/Footer.tsx) displays the new logo image instead of the text “SolviroStudio”.",
        "All logo images include meaningful alt text (e.g., “SolviroStudio logo”) and do not cause layout shifts when scrolling (TopNav scroll state remains stable).",
        "The logo scales responsively and remains legible on both transparent (top-of-page) and scrolled (bg-background/95) nav states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BrandLogo.tsx",
          "operation": "create",
          "description": "Create a small shared BrandLogo component that renders the header logo asset from frontend/public/assets/generated/solvirostudio-logo-header.dim_800x240.png with fixed height/width attributes (to prevent layout shift) and meaningful alt text."
        },
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Replace the text-only “SolviroStudio” branding with the shared BrandLogo component; ensure sizing/alignment matches the existing layout and remains stable between transparent and scrolled nav states (no layout shifts)."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Replace footer text-only “SolviroStudio” branding instances with the shared BrandLogo component while keeping accessible text via alt or visually-hidden text; preserve existing spacing and typography around the copyright line."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal global utility styling (if needed) to keep the logo visually crisp on both light and dark backgrounds (e.g., subtle drop-shadow/contrast adjustments) without changing the overall brand color system."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Update the HTML document head to reference the new favicon derived from the uploaded logo.",
      "acceptanceCriteria": [
        "frontend/index.html references a favicon file derived from the uploaded logo (e.g., /assets/generated/solvirostudio-favicon...).",
        "The favicon loads correctly in the browser tab when running the app."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add favicon metadata linking to frontend/public/assets/generated/solvirostudio-favicon.dim_256x256.png so the browser tab icon updates correctly."
        }
      ]
    }
  ]
}